##todo: Самостоятельная работа

# Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения с остатком.


a = int(input('первое число'))
b = int(input('второе число'))
print (a+b,a-b,a*b,a/b,a//b,a**b)